Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་ལ་འཁྲུལ་བ་མི་མངའོ་ཞེས་བྱ་བ་ནི་སྐུ་དང་གསུང་དང་ཐུགས་ཀྱི་མཛད་པ་རྣམས་ལ་འཁྲུལ་པ་མི་མངའ་བ་སྟེ། ཇི་ལྟར་འདི་ནི་དགྲ་བཅོམ་པ་རྣམས་གྲོང་ལ་སོགས་པར་བསོད་སྙོམས་ཀྱི་ཕྱིར་རྒྱུ་བ་ན། གླང་པོ་ཆེ་དང་། རྟ་དང་།
en: In their activities they do not go wrong physically, verbally, or mentally.

source: བ་གླང་དང་། ཁྱི་གཏུམ་པོ་དང་། ཚེར་མ་དང་། སྡིག་སྦྲུལ་ལ་སོགས་པའི་གདོན་པ་རྣམས་འབྱུང་བ་དང་། དགོན་པ་ན་ཆོམ་རྐུན་དང་།
en: When worthy ones go to town and so on to beg food they are hurt by savage elephants, horses, bulls, and dogs, and by thorn bushes, poisonous snakes and so on; in the jungle they get scared by robbers, tigers, and leopards.

source: སྟག་དང་། གཟིག་གི་འཇིགས་པ་འབྱུང་བ་མི་ཤེས་པ་ལས་གྱུར་པའི་འཁྲུལ་པ་དེ་ལྟ་བུ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མི་མངའོ།
en: Tathāgatas never go wrong from a lack of knowledge in these ways that worthy ones do.

source: །དེ་བཞིན་གཤེགས་པ་ནི་བསྙེལ་བ་མི་མངའ་བའི་ཆོས་ཅན་ཏེ། བརྟགས་ན་སྐྱོན་མི་མངའ་བ་ཉིད་དུ་སེམས་ཅན་ལ་མཛད་པ་རྩོམ་མོ།
en: Tathāgatas are never robbed of mindfulness; they undertake activities for beings and are never found to be at fault.

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་ལམ་ནི་འཇིག་རྟེན་ལ་མཛེས་སོ། །ཀུན་ཏུ་གཟིགས་པ་དང་། རྣམ་པར་གཟིགས་པ་དང་།
en: The ways tathāgatas carry themselves beautify the world.

source: བསྐུམ་པ་དང་། བརྐྱང་བ་ལ་སོགས་པ་ནི་མི་དང་། ལྷ་དང་། ཚངས་པ་ཐམས་ཅད་དང་། དུད་འགྲོ་ཐམས་ཅད་ཀྱང་ཚིམ་པར་བྱེད་པ་སྟེ།
en: Looking around, peering, pulled in, and stretched out and so on, they make all humans, gods, and Brahmās, and even all animals, feel content.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་བཞུད་པ་དང་། བྱོན་པ་ལ་སོགས་པ་ཐམས་ཅད་ན་ཞབས་གཉིས་ཀྱི་མཐིལ་ས་ལ་མི་རེག་གོ།
en: Thus, always while going and coming and so on the soles of their feet do not touch the ground.

source: །འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པའི་རྗེས་ས་ལ་འབྱུང་ངོ་། །གང་དུ་དེ་བཞིན་གཤེགས་པའི་ཞབས་བོར་བ་དེར་པདྨོ་ཡིད་དུ་འོང་བ།
en: Tathāgatas leave footprints of thousand-spoked wheels on the earth, and wherever they place their feet fragrant lotuses spring up.

source: བསུང་དང་ལྡན་པ་དག་འབྱུང་ངོ་། །ཞབས་ཀྱིས་དུད་འགྲོ་ལ་རེག་ན་ཡང་ཞག་བདུན་དུ་བདེ་བ་མཆོག་གིས་ཚིམ་པར་གྱུར་ཏེ། ཤི་འཕོས་ན་ཡང་བདེ་འགྲོ་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: Even if an animal is touched by their feet, it feels content with a supreme pleasure for seven days, and even if it dies it is born in a good form of life such as a heaven.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ན་བཟའ་སོར་བཞིར་མི་རེག་ཅིང་། རྣམ་པར་འཐོར་རླུང་གིས་ཀྱང་བསྐྱོད་པར་མི་ནུས་སོ།
en: Clothes do not touch the tathāgatas’ bodies by four finger-widths and even a gusty wind cannot move them.

source: །སྐུའི་འོད་ཀྱིས་ཀྱང་མནར་མེད་པ་ལ་ཐུག་པའི་བར་གྱི་སེམས་ཅན་རྣམས་བདེ་བ་དག་ཐོབ་པར་འགྱུར་ཏེ།
en: The light from their bodies brings pleasure to all beings, even to those as far away as the Avīci hell.

source: དེ་བས་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་འཁྲུལ་པ་མི་མངའོ་ཞེས་བྱའོ།
en: Hence, it says “tathāgatas do not go wrong physically.”

source: །གསུང་ལ་ཡང་འཁྲུལ་པ་མི་མངའ་སྟེ། དུས་སུ་གསུང་བ་དང་། བདེན་པར་གསུང་བ་དང་། སྙན་པར་གསུང་བ་དང་། མ་ནོར་བར་གསུང་བའི་ཕྱིར།
en: They also do not go wrong verbally because they speak at the right time, speak truthfully, speak pleasantly, and speak faultlessly.

source: གསུང་སྐྱོན་ཐམས་ཅད་དང་བྲལ་བ་སྟེ། ཟློས་བུར་མི་གསུང་བ་དང་། ཤིན་ཏུ་ངེས་པར་གསུང་བ་དང་། རིགས་པ་དང་ལྡན་པར་གསུང་བ་དང་། གསུང་གཅིག་བརྗོད་པས་སྐད་ཅིག་གཅིག་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་གོ་བར་མཛད་པའི་ཕྱིར་རོ།
en: Their speech is separated from all faults because they do not needlessly repeat themselves, and they speak definitively, speak logically, and with a single statement cause all beings to understand in a single instant.

source: །ཐུགས་ལ་ཡང་འཁྲུལ་པ་མི་མངའ་སྟེ། རྟག་ཏུ་མཉམ་པར་གཞག་པ་དང་། བསྙེལ་བ་མི་མངའ་བའི་ཆོས་ཅན་དང་། ཆོས་ཐམས་ཅད་ལ་ཆགས་པ་དང་། སྒྲིབ་པ་མི་མངའ་བར་མཁྱེན་ཅིང་གཟིགས་པ་དང་མཛད་པ་ཐམས་ཅད་ལ་རྟག་ཏུ་ལྷུན་གྱིས་གྲུབ་ཅིང་རྣམ་པར་མི་རྟོག་པའི་ཕྱིར་རོ།
en: They also do not go wrong mentally because they are always in meditative absorption, are not robbed of mindfulness, and they know all dharmas—having no attachments or obscurations with respect to them—always seeing and acting spontaneously and without thought construction.

source: །དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་ལ་འཁྲུལ་པ་མི་མངའ་བ་ཞེས་བྱ་སྟེ།
en: Thus, it says tathāgatas “do not go wrong.”

source: འདི་ནི་མ་འདྲེས་པའི་ཆོས་དང་པོའོ།
en: This is the first distinct attribute. “[They] do not shout out.”

source: །ཅ་ཅོ་མི་མངའོ་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་དགྲ་བཅོམ་པ་དག་དགོན་པ་ན་ལམ་སྟོར་ནས་ཅ་ཅོའི་སྒྲ་འབྱིན་པ་འམ། བག་ཆགས་ཀྱི་དབང་གིས་གད་མོ་རྟ་གད་འབྱིན་པ་དང་། ཚིག་ལ་ཡི་གེ་ལོག་པར་འབྱུང་བ་དེ་ལྟར་སངས་རྒྱས་རྣམས་ལ་ཅ་ཅོ་མི་མངའ་སྟེ། སེམས་ཅན་ཐམས་ཅད་དང་། ཆོས་ཐམས་ཅད་ལ་རྗེས་སུ་ཆགས་པ་དང་།
en: When worthy ones wander off the path in the forest they yell and shout out, or, because of the force of habit, bray out laughing or get the syllables in words wrong.

source: ཁོང་ཁྲོ་བ་མི་མངའ་བ་དང་། འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པ་དང་། རྟག་ཏུ་མཉམ་པར་གཞག་པ་དང་། ཉོན་མོངས་པ་མི་མངའ་བར་བཞུགས་པ་དང་། བག་ཆགས་ཐམས་ཅད་ཡང་དག་པར་བཅོམ་པའི་ཕྱིར་རོ།
en: Buddhas do not shout out like that because they do not get attached to or angry at any beings or any dharmas, and they have transcended all worldly dharmas, are always in meditative equipoise, dwell without afflictions, and have destroyed all residual impressions.

source: །དེ་བས་ན་ཅ་ཅོ་མི་མངའ་བ་ཞེས་བྱ་སྟེ།
en: Thus, it says “do not shout out.”

source: འདི་ནི་མ་འདྲེས་པའི་ཆོས་གཉིས་པའོ།
en: This is the second distinct attribute. “[They] are not robbed of mindfulness.”

source: །བསྙེལ་བ་མི་མངའོ་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་དགྲ་བཅོམ་པ་རྣམས་མ་བསམས་ནས་བརྗེད་པར་བྱ་བ་ཤོར་བ་དང་། དུས་ལས་ཡོལ་བར་འགྱུར་བ་དེ་ལྟ་བུ་དེ་བཞིན་གཤེགས་པ་ལ་མི་མངའ་སྟེ། དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཐམས་ཅད་དང་། ཆོས་ཐམས་ཅད་དང་མཛད་པ་ཐམས་ཅད་དང་། དུས་ཐམས་ཅད་དུ་བསྙེལ་བ་མི་མངའོ།
en: Tathāgatas are not like worthy ones who forget and drop the task at hand when they do not think about it and miss the opportunity, because they are never robbed of mindfulness when it comes to all the needs of beings, all dharmas, and all their activities.

source: །དེ་བས་ན་བསྙེལ་བ་མི་མངའ་བ་ཞེས་བྱ་སྟེ།
en: Thus, it says “not robbed of mindfulness.”

source: འདི་ནི་མ་འདྲེས་པའི་ཆོས་གསུམ་པའོ།
en: This is the third distinct attribute. “[

source: །སེམས་མཉམ་པར་མ་བཞག་པ་མི་མངའོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་དགྲ་བཅོམ་པ་དག་གང་གི་ཚེ།
en: They] do not have uncollected thoughts.”

source: སྙོམས་པར་འཇུག་པ་དེ་ཉིད་ཀྱི་ཚེ་ན་མཉམ་པར་གཞག་པར་འགྱུར་གྱི་གཞན་གྱི་ཚེ་ནི་མ་ཡིན་ནོ།
en: Worthy ones are in equipoise only when they are in meditative absorption, not at other times.

source: །དེ་བཞིན་གཤེགས་པ་ནི་སྙོམས་པར་ཞུགས་ཀྱང་རུང་། སྙོམས་པར་མ་ཞུགས་ཀྱང་རུང་། དུས་ཐམས་ཅད་དུ་མཉམ་པར་གཞག་པ་ཉིད་དེ། དེ་བཞིན་གཤེགས་པ་ནི་ཏིང་ངེ་འཛིན་ཟབ་མོ་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Tathāgatas are not thus—whether they are in meditative absorption or not in meditative absorption, they are always in equipoise because they have completed the supreme, deep meditative stabilizations.

source: འདི་ནི་མ་འདྲེས་པའི་ཆོས་བཞི་པའོ།
en: This is the fourth distinct attribute. “[They] do not discriminate differences.”

source: །ཐ་དད་པའི་འདུ་ཤེས་མི་མངའོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་དགྲ་བཅོམ་པ་དག་ནི་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་དག་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་ཆོས་ལ་སོགས་པ་ཐ་དད་པའི་བློ་འཇུག་གི།
en: Worthy ones see saṃsāra and nirvāṇa, defilement and purification dharmas, and so on as different.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: Tathāgatas do not.

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་རྟག་ཏུ་སེམས་ཅན་མཉམ་པ་ཉིད་དང་། ཆོས་མཉམ་པ་ཉིད་ལ་འཇུག་སྟེ། ཐུགས་རྗེའི་དབང་དང་། རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་ཀྱི་དབང་གིས། འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པ་འམ། དཀར་པོ་དང་། ནག་པོའི་ཆོས་རྣམས་སམ། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་། ཚུལ་ཁྲིམས་འཆལ་པའམ།
en: Tathāgatas always see beings as being the same, and dharmas as being the same.

source: ཕན་འདོགས་པ་དང་། གནོད་པ་བྱེད་པའམ། ཡང་དག་པ་ཉིད་དུ་ངེས་པ་དང་། ལོག་པ་ཉིད་དུ་ངེས་པའམ། སེམས་ཅན་མཆོག་དང་ཐ་མ་རྣམས་ལ་ཐ་དད་པའི་འདུ་ཤེས་མི་འཇུག་སྟེ།
en: Governed by compassion and governed by nonconceptual knowledge, they do not discriminate a difference between saṃsāra and nirvāṇa, or bright and dark dharmas, or moral and immoral, or helpful and harmful, or destined for perfection and destined for wrong, or the finest beings and the lowest beings.

source: འདི་ནི་མ་འདྲེས་པའི་ཆོས་ལྔ་པའོ།
en: This is the fifth distinct attribute. “[

source: །སོ་སོར་མ་བརྟགས་པའི་བཏང་སྙོམས་མི་མངའོ་ཞེས་བྱ་བ་ནི།
en: They] are not inconsiderately dispassionate.”

source: ཇི་ལྟར་དགྲ་བཅོམ་པ་རྣམས་སོ་སོ་མ་བརྟགས་པར་སེམས་ཅན་གྱི་དོན་ཡལ་བར་འདོར་བ་དེ་བཞིན་དུ། དེ་བཞིན་གཤེགས་པ་མི་མཛད་དེ།
en: Unlike worthy ones who inconsiderately ignore the welfare of beings, tathāgatas do not do so.

source: དེ་ནི་དུས་དང་དུས་མ་ཡིན་པ་དང་། སྐལ་བ་ཡོད་པ་དང་སྐལ་བ་མེད་པ་དང་། དོན་ཡོད་པ་དང་དོན་མེད་པ་སོ་སོར་བརྟགས་ནས་ཡལ་བར་འཇོག་པ་ཡིན་གྱི་གཞན་དུ་མ་ཡིན་ཏེ།
en: They deem it something they can ignore only after considering what is and is not the right time, who has good fortune and who has no good fortune, and when it is not in vain and when it is in vain, not otherwise.

source: འདི་ནི་དྲུག་པའོ།
en: This is the sixth. “[

source: །འདུན་པ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །བརྩོན་འགྲུས་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །དྲན་པ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །ཏིང་ངེ་འཛིན་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །ཤེས་རབ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ།
en: They] are not deficient in yearning, are not deficient in perseverance, are not deficient in recollection, are not deficient in meditative stabilization, are not deficient in wisdom, are not deficient in liberation, and are not deficient in the insight into knowledge of liberation.”

source: །རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ་ཞེས་བྱ་བ་ནི་དགྲ་བཅོམ་པ་དག་ནི་སྤྱོད་ཡུལ་གྱི་དབང་གིས་རང་བཞིན་གྱིས་སངས་རྒྱས་ཀྱི་ས་དང་། རང་བཞིན་གྱིས་སངས་རྒྱས་ཀྱི་མཛད་པ་ལ་འདུན་པ་མི་སྐྱེའི།
en: Worthy ones, because of their nature, do not have the “yearning” for the activities of buddhas because based on their range such things are naturally done by buddhas.

source: ཉན་ཐོས་ཀྱི་བྱ་བ་ཉིད་ལ་འདུན་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་སའི་བརྩོན་འགྲུས་དང་། དྲན་པ་དང་།
en: They have yearning for just the activities of śrāvakas.

source: ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་གང་ཡིན་པ་དེ་དག་ནི་ཉན་ཐོས་རྣམས་ལ་མེད་དེ། དེ་བས་ན་འདུན་པ་ལ་སོགས་པ་ཆོས་བདུན་པོ་དེ་དག་མ་ཐོབ་པར་ཡོངས་སུ་ཉམས་པས་ཡོངས་སུ་ཉམས་པ་ཡིན་ནོ།
en: Similarly, śrāvakas do not have buddha-level “perseverance, recollection, meditative stabilization, wisdom, liberation, and knowledge and seeing of liberation,” because they are “deficient” insofar as they do not obtain the seven dharmas, yearning and so on.

source: །སངས་རྒྱས་རྣམས་ནི་ཁྱད་པར་ཅན་གྱི་ཆོས་མ་བརྙེས་པ་མི་མངའ་སྟེ།
en: Buddhas, though, have gained the special attributes.

source: ཆོས་ཐམས་ཅད་ཐུགས་སུ་ཆུད་པར་གྱུར་པས་ཡོངས་སུ་ཉམས་པ་ཅུང་ཟད་ཀྱང་མི་མངའ་སྟེ།
en: Because they have comprehended all dharmas they are not deficient in the slightest.

source: འདི་ལྟར་སངས་རྒྱས་རྣམས་ནི་དུས་ཐམས་ཅད་དུ་སེམས་ཅན་གྱི་དོན་མཛད་པ་ལ་འདུན་པ་རྒྱུན་མི་འཆད་པར་འབྱུང་ངོ་། །བྱམས་པ་ཆེན་པོ་དང་། ཐུགས་རྗེ་ཆེན་པོ་ལ་སོགས་པའི་ཆོས་ལ་འདུན་པ་དང་། ཆོས་འཆད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་བླངས་ནས་དཀོན་མཆོག་གསུམ་གྱི་རྒྱུན་མི་བཅད་པའི་འདུན་པ་རྒྱུན་མི་འཆད་པར་འབྱུང་ངོ་།
en: This is because buddhas have an unbroken desire to do what is necessary for the welfare of all beings at all times; they have the desire to bring about within themselves the attributes of great love and great compassion and so on; and they have the unbroken desire to explain the doctrine, bring beings to maturity, and, having roused the thought of awakening, make unbroken the continuity of the Three Jewels.

source: །དེ་བཞིན་གཤེགས་པ་ནི་བརྩོན་འགྲུས་ཐམས་ཅད་ལ་སྐུ་བསྙེལ་བའམ།
en: Tathāgatas “persevere” in everything.

source: ཐུགས་བསྙེལ་བ་ནམ་ཡང་མི་འབྱུང་ངོ་།
en: They never get physically tired and never get mentally tired.

source: །དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་གཅིག་གི་དོན་དུ་ཡང་བསྐལ་པར་ཡང་བཤོས་མི་གསོལ་བར་ཆོས་སྟོན་ཏོ། །དེ་བཞིན་གཤེགས་པ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱང་འདས་པར་མཛད་ནས་གང་ན་སངས་རྒྱས་ཀྱིས་འདུལ་བར་འགྱུར་བ་སེམས་ཅན་གཅིག་ཡོད་པ་དེར་གཤེགས་སོ། །དེ་བཞིན་གཤེགས་པའི་དྲན་པ་ལ་ཡང་ཡོངས་སུ་ཉམས་པ་མི་མངའ་སྟེ། འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་
en: Tathāgatas teach the doctrine for the sake of a single being even for eons without taking a break; having passed through as many buddhafields as there are grains of sand in the Gaṅgā River, they go wherever there are beings for the buddhas to train.

source: བྱུང་བའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དང་། གཡོ་བ་ཐམས་ཅད་དང་། བསམ་པ་དང་། བག་ལ་ཉལ་བ་དང་། ཉོན་མོངས་པ་དང་། དབང་པོ་ལ་སོགས་པ་ཐམས་ཅད་དང་།
en: Tathāgatas are “not deficient in recollection” either.

source: སེམས་ཅན་གདུལ་བའི་ཐབས་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་དོན་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་མཛད་པ་ཐམས་ཅད་དང་། ཆོས་ཇི་ལྟར་དགོངས་པ་དང་། གཟིགས་པ་ཐམས་ཅད་དྲན་པའི་ལམ་དུ་གཞག་པས།
en: Having become unsurpassed, perfect, complete buddhas, tathāgatas place on their path of recollection the thought activities, movements, intentions, tendencies, afflictions, faculties and so on of all past, future, and present beings; all the methods to train beings; all the needs of beings; all the deeds of buddhas; what the doctrines intend; and all to be seen, but they do not direct their minds to them after the event.

source: དེ་ལ་ཕྱིས་ཡེ་ཤེས་གཏོང་བ་མི་མཛད་དེ། དེ་བཞིན་གཤེགས་པའི་དྲན་པ་ནི་དུས་ཐམས་ཅད་དུ་ཡོངས་སུ་ཉམས་པ་མི་མངའ་བ་ཉིད་དོ།
en: The recollection of a tathāgata has no deficiency.

source: །དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ལ་ཡང་ཡོངས་སུ་ཉམས་པ་མི་མངའ་སྟེ།
en: Tathāgatas are also “not deficient in meditative stabilization.”

source: སེམས་ཅན་ཐམས་ཅད་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལ་མཉམ་པར་གཞག་པས་དེ་བཞིན་ཉིད་མཉམ་པ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་མཉམ་པར་འཇོག་གོ།
en: In a meditative equipoise on the suchness of all beings and all phenomena, all phenomena are placed in an equal state through the suchness that is a sameness.

source: །དེ་བས་ན་དེ་བཞིན་ཉིད་ལ་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ།
en: Hence, suchness is called “meditative stabilization.”

source: །དེ་བཞིན་ཉིད་དེ་ཡང་ནམ་མཁའ་དང་མཚུངས་ཏེ།
en: That suchness, furthermore, is like space.

source: དེ་ལ་འཕེལ་བ་འམ། ཡོངས་སུ་འགྲིབ་པ་མེད་ཅིང་། དུས་ཐམས་ཅད་དུ་དེ་བཞིན་བས་ན་དེ་བཞིན་ཉིད་དེ།
en: In it there is no increase and there is no obscuration; it is as it is at all times, hence it is suchness.

source: དེ་བས་ན་ཏིང་ངེ་འཛིན་ལ་ཉམས་པ་མི་མངའོ།
en: Hence their meditative stabilization has no deficiency.

source: །ཤེས་རབ་ལ་ཡོངས་སུ་ཉམས་པ་མི་མངའ་སྟེ།
en: They are also “not deficient in wisdom.”

source: འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་མཁྱེན་པ་མི་ཟད་པ་དང་། ཆོས་བསྟན་པ་མཁྱེན་པ་མི་ཟད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་མཁྱེན་པ་མི་ཟད་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་མཁས་པའི་མཁྱེན་པ་མི་ཟད་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་བཤད་པའོ།
en: Thus, it says they have “the inexhaustible knowledge of the thought activities of all beings, the inexhaustible knowledge of the teaching of doctrine, the inexhaustible knowledge for bringing beings to maturity, the inexhaustible knowledge of skill in the detailed and thorough knowledges” and so on.

source: །རྣམ་པར་གྲོལ་བ་ཡང་ཡོངས་སུ་ཉམས་པ་མི་མངའ་སྟེ།
en: They are also “not deficient in liberation.”

source: རྣམ་པར་གྲོལ་བ་ཞེས་བྱ་བ་ལ་ཉན་ཐོས་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བ་ནི་སྒྲའི་རྗེས་སུ་འགྲོ་བའོ། །རང་སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བ་ནི་རྐྱེན་གྱི་རྗེས་སུ་འགྲོ་བའོ། །སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བ་ནི་ཆོས་ཉིད་ཀྱི་རྗེས་སུ་འགྲོ་བ་འདི་ཡིན་ཏེ། ཉོན་མོངས་པའི་སྒྲིབ་པ་ལས་རྣམ་པར་གྲོལ་བ་དང་། ཤེས་བྱའི་སྒྲིབ་པ་ལས་རྣམ་པར་གྲོལ་བ་དང་།
en: As for “liberation,” śrāvaka liberation is intimately connected with words, pratyekabuddha liberation is intimately connected with conditions, and buddha liberation is intimately connected with the true nature of dharmas: these being liberation from the obscuration of affliction, liberation from obscuration to knowing, and, because it is the result, liberation through absorption, and liberation that is nonabiding nirvāṇa.

source: འབྲས་བུའི་ཕྱིར་སྙོམས་པར་འཇུག་པས་རྣམ་པར་གྲོལ་བ་དང་། མི་གནས་པའི་མྱ་ངན་ལས་འདས་པའི་རྣམ་པར་གྲོལ་བ་སྟེ། དེ་རྣམ་པར་གྲོལ་བ་ཐམས་ཅད་ཟད་མི་ཤེས་ཤིང་། ནམ་མཁའ་ལྟ་བུར་གྱུར་པས་སེམས་ཅན་གྱི་དོན་མཛད་པ་ལ་འཁོར་བ་ཇི་སྲིད་ཡོད་ཀྱི་བར་དུ་འཇུག་པས་ན་རྣམ་པར་གྲོལ་བ་ལ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ།
en: All liberation is known to be inexhaustible and, serving like space, its work for the welfare of beings operates for as long as saṃsāra exists.

source: །ཇི་ལྟར་རྣམ་པར་གྲོལ་བ་ལ་ཡོངས་སུ་ཉམས་པ་མི་མངའ་བ་དེ་བཞིན་དུ་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལ་ཡང་ཡོངས་སུ་ཉམས་པ་མི་མངའ་བ་སྟེ།
en: Hence, they are “not deficient in liberation.” Just as they are not deficient in liberation, so too they are “not deficient in knowledge and seeing of liberation.”

source: འདི་ནི་ཆོས་བཅུ་གཉིས་པའོ།
en: This is the twelfth attribute. “

source: །སྐུའི་ཕྲིན་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་ངོ་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་དགྲ་བཅོམ་པ་གཞན་དག་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་རྣམས་བསམས་བཞིན་མེད་པར་བྱེད་པ་དང་། ཉེས་པ་ཡང་མཐོལ་བ་དང་།
en: All physical actions are preceded by knowledge and informed by knowledge.” Others—worthy ones—engage in unintended physical, verbal, and mental actions, confess faults, and also do not have certain experiences because of earlier habit formations.

source: བག་ཆགས་ཀྱི་མ་ཚོར་བ་ཡང་བྱེད་པ་དེ་ལྟར་ཡང་སངས་རྒྱས་རྣམས་མི་མཛད་དེ།
en: Buddhas do not act in that way.

source: སངས་རྒྱས་རྣམས་ནི་གཟིགས་པས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ་ལོ། །གསུང་བ་དང་། ཅང་མི་གསུང་བ་དང་། བཤོས་གསོལ་བ་དང་། མནལ་བ་དང་།
en: Buddhas, even just by looking, train beings.

source: བཞུད་པ་དང་། བྱོན་པ་དང་། བཞུགས་པ་དང་། འཕྲེས་པ་དང་། སྐུ་ལས་འོད་ཟེར་འགྱེད་པ་དང་། མཚན་རྣམས་དང་།
en: They train them by saying something, by not saying anything, by taking a rest, and even by sleeping, going, coming, sitting, or lying down; by radiating out light from their body; by their major marks and minor signs; by taking a step; and by opening their eyes.

source: དཔེ་བྱད་བཟང་པོ་རྣམས་དང་། ཞབས་གོམ་པ་འདོར་བ་དང་། སྤྱན་འབྱེད་པས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ་ལོ། །སངས་རྒྱས་རྣམས་ཀྱི་གསུང་ཐམས་ཅད་ཀྱང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཐམས་ཅད་སྒྲུབ་པ་སྟེ།
en: All the speech of the buddhas accomplishes all the needs of beings as well.

source: དོན་དམ་པར་མི་འགྱུར་ཞིང་རྣམ་པ་དུ་མ་ཡན་ལག་དྲུག་ཅུ་དང་ལྡན་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་།
en: It is not meaningless, comes in many forms, and is endowed with sixty qualities in harmony with the intentions and latent tendencies of all beings.

source: བག་ལ་ཉལ་དང་མཐུན་པར་འབྱུང་ངོ་། །ཐུགས་ཀྱི་ཕྲིན་ལས་ཀྱང་ཉོན་མོངས་པའི་བག་ཆགས་ཐམས་ཅད་དང་། རྟོག་པའི་བག་ཆགས་ཐམས་ཅད་དང་། སྤྲོས་པའི་བག་ཆགས་ཐམས་ཅད་དང་མི་ལྡན་པ་སྟེ།
en: All are “mental actions” unconnected with the residual impressions left by afflictions, with the residual impressions left by conceptualizations, and with the residual impressions left by thought constructions.

source: བྱམས་པ་ཆེན་པོ་དང་། ཐུགས་རྗེ་ཆེན་པོའི་ངང་དང་ལྡན་ཞིང་ཡང་དག་པའི་མཐའ་ཡོངས་སུ་མ་བཏང་བ་དང་། དོན་དམ་པའི་མཚན་ཉིད་ཀྱི་རྗེས་སུ་འཇུག་པའོ།
en: They are intimately connected with great love and great compassion and operate without straying from the very limit of reality, marked by the ultimate.

source: །ཕྲིན་ལས་གསུམ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་ཡེ་ཤེས་ལྔར་བྱུང་བའི་རྒྱུ་ལས་བྱུང་བའི་ཕྱིར་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའོ། །ཡེ་ཤེས་དང་ལྷན་ཅིག་ཏུ་རྒྱུ་བའི་དབང་གིས་ཆོས་གསུམ་པོ་འདི་དག་ནི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བའོ།
en: All three of these actions “are preceded by knowledge” because of the prior occurrence of knowledge; and all these three dharmas are “informed by knowledge” because of the force of knowledge that operates together with them.

source: །དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མཐོང་བ་འདས་པའི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པར་འཇུག་གོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་ཇི་ལྟར་དགྲ་བཅོམ་པ་དག །གང་དང་གང་དུ་རྩོལ་བ་གཏོང་བ་དེ་དང་དེ་ཉིད་ཤེས་ཀྱི་གཞན་དུ་ནི་ཤེས་པ་ཆགས་ཤིང་ཐོགས་པར་གྱུར་པ་དེ་ལྟ་བུ་དེ་བཞིན་གཤེགས་པ་དག་ལ་མི་མངའ་སྟེ། དེ་བཞིན་གཤེགས་པ་དག་ནི་འདས་པའི་དུས་ན་སངས་རྒྱས་ཀྱི་ཞིང་བྱུང་བ་ཇི་སྙེད་ཡོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་ས་དང་ཆུ་དང་། མེ་དང་རླུང་གི་རྡུལ་ཕྲ་རབ་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་། རྩ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་། སེམས་ཅན་གྱི་རིགས་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་། སེམས་ཅན་དེ་དག་གི་རིགས་དང་། ཁ་དོག་དང་། ན་ཚོད་དང་། གཟུགས་དང་།
en: Tathāgatas “see past time with knowledge free from attachment and free from obstruction.”

source: བྱད་ལག་དང་། སེམས་ཀྱི་སྤྱོད་པ་དང་། བསམ་པ་དང་། དབང་པོ་དང་། མོས་པ་ཐ་དད་པ་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་།
en: Worthy ones have knowledge of whatever they direct their energy toward, but their knowledge is attached to and obstructed by anything else.

source: དེ་དག་ཏུ་སངས་རྒྱས་ཇི་སྙེད་བྱུང་བ་རྣམས་དང་། དེ་དག་གིས་ཆོས་བསྟན་པ་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་། ཐེག་པ་གསུམ་ལ་འདུལ་བའི་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་། དེ་ན་ཉན་ཐོས་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་། རང་སངས་རྒྱས་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་། དེ་དག་ཐམས་ཅད་ཀྱི་ཚེའི་ཚད་ཇི་ཙམ་ཐུབ་པ་དང་། དེ་དག་གི་ཟས་ཀྱི་དུས་དང་། གོས་དང་ཡོངས་སུ་སྤྱོད་པ་ཇི་སྙེད་ཡོད་པ་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཏུ་སྲེག་པའི་བསྐལ་པ་ཇི་སྙེད་འབྱུང་བ་དང་།
en: Tathāgatas are unlike them.

source: ཆུ་དང་མེ་དང་རླུང་གིས་འཇིག་པ་ཇི་སྙེད་འབྱུང་བ་དང་། ནམ་མཁའི་ཁམས་ཇི་ཙམ་པ་དང་། སྐར་མའི་གཟུགས་རྣམས་ཇི་སྙེད་ཡོད་པ་དང་། རི་དང་རི་སུལ་དང་། འབབ་ཆུ་དང་། མཚོ་དང་རྒྱ་མཚོ་ཇི་སྙེད་ཡོད་པ་དང་། གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཇི་སྙེད་ཡོད་པ་དང་། ཚོང་དུས་ཀྱི་རྣམ་པར་དབྱེ་བ་ཇི་སྙེད་ཡོད་པ་དང་། ཞིང་དང་། ཀུན་དགའ་ར་བ་དང་། སྐྱེད་མོས་ཚལ་དང་། ནགས་ཚལ་ཇི་སྙེད་ཡོད་པ་དང་། དེ་ན་སེམས་ཅན་གྱི་འཆི་འཕོ་དང་། སྐྱེ་བ་དང་། འགྲོ་བ་རབ་ཏུ་དབྱེ་བ་ཇི་སྙེད་ཡོད་པ་དང་། དེ་དག་གི་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་ཇི་སྙེད་ཡོད་པ་དང་། མིག་འབྱེད་པ་དང་། འཛུམས་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག་དང་།
en: Tathāgatas, in the manner of counting, know directly, and delineate and know exactly, as many buddhafields as there were in past times; as many tiny earth, water, fire, and wind particles as there were in those buddhafields; as many blades of grass, twigs on the trees, medicinal herbs, and forests as there were; as many families of beings as there were; the different statuses, colors, ages, shapes, facial expressions, mental activities, aspirations, faculties, and beliefs of those beings, as many as there were; as many buddhas as there were there, and as many doctrines as they taught; as many beings trained in the three vehicles as there were—as many śrāvakas as there were, as many pratyekabuddhas as there were, and as many bodhisattvas as there were; how long they were able to live, and their meal times, clothing, and belongings, as many as there were; which eons those world systems burned up in, and how much destruction there was of them by water, fire, and wind; how much of the space element there was; as many configurations of the stars as there were, and as many mountains, ravines, waterfalls, lakes, and oceans as there were; as many villages, towns, cities, countries, kingdoms, and centers of empire as there were; as many divisions of markets as there were; as many fields, gardens, parks, and woods as there were; as many deaths, rebirths, and different forms of life of the beings as there were; the in and out breaths they took, as many as there were; the opening and shutting of the eyes of all beings there, as many as there were; and everything else like that as well, all of it, in one instant.

source: དེ་འདྲ་བ་གཞན་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པས་སྐད་ཅིག་གཅིག་ལ་བགྲང་བའི་ཚུལ་དུ་མངོན་སུམ་གྱིས་མཁྱེན་པས་ཡོངས་སུ་བཅད་དེ་རབ་ཏུ་མཁྱེན་ཏོ། །དེ་བཞིན་དུ་མ་འོངས་པ་དང་། དེ་བཞིན་དུ་ད་ལྟར་བྱུང་བ་ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མ་ཆགས་མ་ཐོགས་པར་འཇུག་སྟེ།
en: The tathāgatas’ knowledge is similarly free from attachment and free from obstruction to everything in “the future,” and similarly in “the present” too.

source: འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་དོ།
en: Those are “the eighteen distinct attributes of a buddha.” 21.

source: །གཟུངས་ཀྱི་སྒོ་ཐེག་པ་ཆེན་པོ་ནི་དེ་ལ་གཟུངས་ཀྱི་སྒོ་དག་གང་ཞེ་ན།
en: Great Vehicle of the dhāraṇī gateways What are the dhāraṇī gateways?

source: འདི་ལྟ་སྟེ། ཡི་གེའི་ཚུལ་མཉམ་པ་ཉིད་དང་། ཡི་གེའི་སྒོ་དང་། ཡི་གེ་ལ་འཇུག་པ་ཞེས་བྱ་བ་སྟེ།
en: It is like this: there is the sameness of the way the letters work, the letters as gateways, and entrances through letters.
